ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MP_AHB6ENCLRR register fields */
#define RCC_MP_AHB6ENCLRR_MDMAEN		BIT(0)
#define RCC_MP_AHB6ENCLRR_GPUEN			BIT(5)
#define RCC_MP_AHB6ENCLRR_ETHCKEN		BIT(7)
#define RCC_MP_AHB6ENCLRR_ETHTXEN		BIT(8)
#define RCC_MP_AHB6ENCLRR_ETHRXEN		BIT(9)
#define RCC_MP_AHB6ENCLRR_ETHMACEN		BIT(10)
#define RCC_MP_AHB6ENCLRR_FMCEN			BIT(12)
#define RCC_MP_AHB6ENCLRR_QSPIEN		BIT(14)
#define RCC_MP_AHB6ENCLRR_SDMMC1EN		BIT(16)
#define RCC_MP_AHB6ENCLRR_SDMMC2EN		BIT(17)
#define RCC_MP_AHB6ENCLRR_CRC1EN		BIT(20)
#define RCC_MP_AHB6ENCLRR_USBHEN		BIT(24)

/* RCC_MP_TZAHB6ENSETR register fields */
#define RCC_MP_TZAHB6ENSETR_MDMAEN		BIT(0)

/* RCC_MP_TZAHB6ENCLRR register fields */
#define RCC_MP_TZAHB6ENCLRR_MDMAEN		BIT(0)

/* RCC_MC_APB4ENSETR register fields */
#define RCC_MC_APB4ENSETR_LTDCEN		BIT(0)
#define RCC_MC_APB4ENSETR_DSIEN			BIT(4)
#define RCC_MC_APB4ENSETR_DDRPERFMEN		BIT(8)
#define RCC_MC_APB4ENSETR_USBPHYEN		BIT(16)
#define RCC_MC_APB4ENSETR_STGENROEN		BIT(20)

/* RCC_MC_APB4ENCLRR register fields */
#define RCC_MC_APB4ENCLRR_LTDCEN		BIT(0)
#define RCC_MC_APB4ENCLRR_DSIEN			BIT(4)
#define RCC_MC_APB4ENCLRR_DDRPERFMEN		BIT(8)
#define RCC_MC_APB4ENCLRR_USBPHYEN		BIT(16)
#define RCC_MC_APB4ENCLRR_STGENROEN		BIT(20)

/* RCC_MC_APB5ENSETR register fields */
#define RCC_MC_APB5ENSETR_SPI6EN		BIT(0)
#define RCC_MC_APB5ENSETR_I2C4EN		BIT(2)
#define RCC_MC_APB5ENSETR_I2C6EN		BIT(3)
#define RCC_MC_APB5ENSETR_USART1EN		BIT(4)
#define RCC_MC_APB5ENSETR_RTCAPBEN		BIT(8)
#define RCC_MC_APB5ENSETR_TZC1EN		BIT(11)
#define RCC_MC_APB5ENSETR_TZC2EN		BIT(12)
#define RCC_MC_APB5ENSETR_TZPCEN		BIT(13)
#define RCC_MC_APB5ENSETR_BSECEN		BIT(16)
#define RCC_MC_APB5ENSETR_STGENEN		BIT(20)

/* RCC_MC_APB5ENCLRR register fields */
#define RCC_MC_APB5ENCLRR_SPI6EN		BIT(0)
#define RCC_MC_APB5ENCLRR_I2C4EN		BIT(2)
#define RCC_MC_APB5ENCLRR_I2C6EN		BIT(3)
#define RCC_MC_APB5ENCLRR_USART1EN		BIT(4)
#define RCC_MC_APB5ENCLRR_RTCAPBEN		BIT(8)
#define RCC_MC_APB5ENCLRR_TZC1EN		BIT(11)
#define RCC_MC_APB5ENCLRR_TZC2EN		BIT(12)
#define RCC_MC_APB5ENCLRR_TZPCEN		BIT(13)
#define RCC_MC_APB5ENCLRR_BSECEN		BIT(16)
#define RCC_MC_APB5ENCLRR_STGENEN		BIT(20)

/* RCC_MC_AHB5ENSETR register fields */
#define RCC_MC_AHB5ENSETR_GPIOZEN		BIT(0)
#define RCC_MC_AHB5ENSETR_CRYP1EN		BIT(4)
#define RCC_MC_AHB5ENSETR_HASH1EN		BIT(5)
#define RCC_MC_AHB5ENSETR_RNG1EN		BIT(6)
#define RCC_MC_AHB5ENSETR_BKPSRAMEN		BIT(8)

/* RCC_MC_AHB5ENCLRR register fields */
#define RCC_MC_AHB5ENCLRR_GPIOZEN		BIT(0)
#define RCC_MC_AHB5ENCLRR_CRYP1EN		BIT(4)
#define RCC_MC_AHB5ENCLRR_HASH1EN		BIT(5)
#define RCC_MC_AHB5ENCLRR_RNG1EN		BIT(6)
#define RCC_MC_AHB5ENCLRR_BKPSRAMEN		BIT(8)

/* RCC_MC_AHB6ENSETR register fields */
#define RCC_MC_AHB6ENSETR_MDMAEN		BIT(0)
#define RCC_MC_AHB6ENSETR_GPUEN			BIT(5)
#define RCC_MC_AHB6ENSETR_ETHCKEN		BIT(7)
#define RCC_MC_AHB6ENSETR_ETHTXEN		BIT(8)
#define RCC_MC_AHB6ENSETR_ETHRXEN		BIT(9)
#define RCC_MC_AHB6ENSETR_ETHMACEN		BIT(10)
#define RCC_MC_AHB6ENSETR_FMCEN			BIT(12)
#define RCC_MC_AHB6ENSETR_QSPIEN		BIT(14)
#define RCC_MC_AHB6ENSETR_SDMMC1EN		BIT(16)
#define RCC_MC_AHB6ENSETR_SDMMC2EN		BIT(17)
#define RCC_MC_AHB6ENSETR_CRC1EN		BIT(20)
#define RCC_MC_AHB6ENSETR_USBHEN		BIT(24)

/* RCC_MC_AHB6ENCLRR register fields */
#define RCC_MC_AHB6ENCLRR_MDMAEN		BIT(0)
#define RCC_MC_AHB6ENCLRR_GPUEN			BIT(5)
#define RCC_MC_AHB6ENCLRR_ETHCKEN		BIT(7)
#define RCC_MC_AHB6ENCLRR_ETHTXEN		BIT(8)
#define RCC_MC_AHB6ENCLRR_ETHRXEN		BIT(9)
#define RCC_MC_AHB6ENCLRR_ETHMACEN		BIT(10)
#define RCC_MC_AHB6ENCLRR_FMCEN			BIT(12)
#define RCC_MC_AHB6ENCLRR_QSPIEN		BIT(14)
#define RCC_MC_AHB6ENCLRR_SDMMC1EN		BIT(16)
#define RCC_MC_AHB6ENCLRR_SDMMC2EN		BIT(17)
#define RCC_MC_AHB6ENCLRR_CRC1EN		BIT(20)
#define RCC_MC_AHB6ENCLRR_USBHEN		BIT(24)

/* RCC_MP_APB4LPENSETR register fields */
#define RCC_MP_APB4LPENSETR_LTDCLPEN		BIT(0)
#define RCC_MP_APB4LPENSETR_DSILPEN		BIT(4)
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN	BIT(8)
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN	BIT(15)
#define RCC_MP_APB4LPENSETR_USBPHYLPEN		BIT(16)
#define RCC_MP_APB4LPENSETR_STGENROLPEN		BIT(20)
#define RCC_MP_APB4LPENSETR_STGENROSTPEN	BIT(21)

/* RCC_MP_APB4LPENCLRR register fields */
#define RCC_MP_APB4LPENCLRR_LTDCLPEN		BIT(0)
#define RCC_MP_APB4LPENCLRR_DSILPEN		BIT(4)
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN	BIT(8)
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN	BIT(15)
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN		BIT(16)
#define RCC_MP_APB4LPENCLRR_STGENROLPEN		BIT(20)
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN	BIT(21)

/* RCC_MP_APB5LPENSETR register fields */
#define RCC_MP_APB5LPENSETR_SPI6LPEN		BIT(0)
#define RCC_MP_APB5LPENSETR_I2C4LPEN		BIT(2)
#define RCC_MP_APB5LPENSETR_I2C6LPEN		BIT(3)
#define RCC_MP_APB5LPENSETR_USART1LPEN		BIT(4)
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN		BIT(8)
#define RCC_MP_APB5LPENSETR_TZC1LPEN		BIT(11)
#define RCC_MP_APB5LPENSETR_TZC2LPEN		BIT(12)
#define RCC_MP_APB5LPENSETR_TZPCLPEN		BIT(13)
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN	BIT(15)
#define RCC_MP_APB5LPENSETR_BSECLPEN		BIT(16)
#define RCC_MP_APB5LPENSETR_STGENLPEN		BIT(20)
#define RCC_MP_APB5LPENSETR_STGENSTPEN		BIT(21)

/* RCC_MP_APB5LPENCLRR register fields */
#define RCC_MP_APB5LPENCLRR_SPI6LPEN		BIT(0)
#define RCC_MP_APB5LPENCLRR_I2C4LPEN		BIT(2)
#define RCC_MP_APB5LPENCLRR_I2C6LPEN		BIT(3)
#define RCC_MP_APB5LPENCLRR_USART1LPEN		BIT(4)
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN		BIT(8)
#define RCC_MP_APB5LPENCLRR_TZC1LPEN		BIT(11)
#define RCC_MP_APB5LPENCLRR_TZC2LPEN		BIT(12)
#define RCC_MP_APB5LPENCLRR_TZPCLPEN		BIT(13)
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN	BIT(15)
#define RCC_MP_APB5LPENCLRR_BSECLPEN		BIT(16)
#define RCC_MP_APB5LPENCLRR_STGENLPEN		BIT(20)
#define RCC_MP_APB5LPENCLRR_STGENSTPEN		BIT(21)

/* RCC_MP_AHB5LPENSETR register fields */
#define RCC_MP_AHB5LPENSETR_GPIOZLPEN		BIT(0)
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN		BIT(4)
#define RCC_MP_AHB5LPENSETR_HASH1LPEN		BIT(5)
#define RCC_MP_AHB5LPENSETR_RNG1LPEN		BIT(6)
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN		BIT(8)

/* RCC_MP_AHB5LPENCLRR register fields */
#define RCC_MP_AHB5LPENCLRR_GPIOZLPEN		BIT(0)
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN		BIT(4)
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN		BIT(5)
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN		BIT(6)
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN		BIT(8)

/* RCC_MP_AHB6LPENSETR register fields */
#define RCC_MP_AHB6LPENSETR_MDMALPEN		BIT(0)
#define RCC_MP_AHB6LPENSETR_GPULPEN		BIT(5)
#define RCC_MP_AHB6LPENSETR_ETHCKLPEN		BIT(7)
#define RCC_MP_AHB6LPENSETR_ETHTXLPEN		BIT(8)
#define RCC_MP_AHB6LPENSETR_ETHRXLPEN		BIT(9)
#define RCC_MP_AHB6LPENSETR_ETHMACLPEN		BIT(10)
#define RCC_MP_AHB6LPENSETR_ETHSTPEN		BIT(11)
#define RCC_MP_AHB6LPENSETR_FMCLPEN		BIT(12)
#define RCC_MP_AHB6LPENSETR_QSPILPEN		BIT(14)
#define RCC_MP_AHB6LPENSETR_SDMMC1LPEN		BIT(16)
#define RCC_MP_AHB6LPENSETR_SDMMC2LPEN		BIT(17)
#define RCC_MP_AHB6LPENSETR_CRC1LPEN		BIT(20)
#define RCC_MP_AHB6LPENSETR_USBHLPEN		BIT(24)

/* RCC_MP_AHB6LPENCLRR register fields */
#define RCC_MP_AHB6LPENCLRR_MDMALPEN		BIT(0)
#define RCC_MP_AHB6LPENCLRR_GPULPEN		BIT(5)
#define RCC_MP_AHB6LPENCLRR_ETHCKLPEN		BIT(7)
#define RCC_MP_AHB6LPENCLRR_ETHTXLPEN		BIT(8)
#define RCC_MP_AHB6LPENCLRR_ETHRXLPEN		BIT(9)
#define RCC_MP_AHB6LPENCLRR_ETHMACLPEN		BIT(10)
#define RCC_MP_AHB6LPENCLRR_ETHSTPEN		BIT(11)
#define RCC_MP_AHB6LPENCLRR_FMCLPEN		BIT(12)
#define RCC_MP_AHB6LPENCLRR_QSPILPEN		BIT(14)
#define RCC_MP_AHB6LPENCLRR_SDMMC1LPEN		BIT(16)
#define RCC_MP_AHB6LPENCLRR_SDMMC2LPEN		BIT(17)
#define RCC_MP_AHB6LPENCLRR_CRC1LPEN		BIT(20)
#define RCC_MP_AHB6LPENCLRR_USBHLPEN		BIT(24)

/* RCC_MP_TZAHB6LPENSETR register fields */
#define RCC_MP_TZAHB6LPENSETR_MDMALPEN		BIT(0)

/* RCC_MP_TZAHB6LPENCLRR register fields */
#define RCC_MP_TZAHB6LPENCLRR_MDMALPEN		BIT(0)

/* RCC_MC_APB4LPENSETR register fields */
#define RCC_MC_APB4LPENSETR_LTDCLPEN		BIT(0)
#define RCC_MC_APB4LPENSETR_DSILPEN		BIT(4)
#define RCC_MC_APB4LPENSETR_DDRPERFMLPEN	BIT(8)
#define RCC_MC_APB4LPENSETR_USBPHYLPEN		BIT(16)
#define RCC_MC_APB4LPENSETR_STGENROLPEN		BIT(20)
#define RCC_MC_APB4LPENSETR_STGENROSTPEN	BIT(21)

/* RCC_MC_APB4LPENCLRR register fields */
#define RCC_MC_APB4LPENCLRR_LTDCLPEN		BIT(0)
#define RCC_MC_APB4LPENCLRR_DSILPEN		BIT(4)
#define RCC_MC_APB4LPENCLRR_DDRPERFMLPEN	BIT(8)
#define RCC_MC_APB4LPENCLRR_USBPHYLPEN		BIT(16)
#define RCC_MC_APB4LPENCLRR_STGENROLPEN		BIT(20)
#define RCC_MC_APB4LPENCLRR_STGENROSTPEN	BIT(21)

