ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MC_APB5LPENSETR register fields */
#define RCC_MC_APB5LPENSETR_SPI6LPEN		BIT(0)
#define RCC_MC_APB5LPENSETR_I2C4LPEN		BIT(2)
#define RCC_MC_APB5LPENSETR_I2C6LPEN		BIT(3)
#define RCC_MC_APB5LPENSETR_USART1LPEN		BIT(4)
#define RCC_MC_APB5LPENSETR_RTCAPBLPEN		BIT(8)
#define RCC_MC_APB5LPENSETR_TZC1LPEN		BIT(11)
#define RCC_MC_APB5LPENSETR_TZC2LPEN		BIT(12)
#define RCC_MC_APB5LPENSETR_TZPCLPEN		BIT(13)
#define RCC_MC_APB5LPENSETR_BSECLPEN		BIT(16)
#define RCC_MC_APB5LPENSETR_STGENLPEN		BIT(20)
#define RCC_MC_APB5LPENSETR_STGENSTPEN		BIT(21)

/* RCC_MC_APB5LPENCLRR register fields */
#define RCC_MC_APB5LPENCLRR_SPI6LPEN		BIT(0)
#define RCC_MC_APB5LPENCLRR_I2C4LPEN		BIT(2)
#define RCC_MC_APB5LPENCLRR_I2C6LPEN		BIT(3)
#define RCC_MC_APB5LPENCLRR_USART1LPEN		BIT(4)
#define RCC_MC_APB5LPENCLRR_RTCAPBLPEN		BIT(8)
#define RCC_MC_APB5LPENCLRR_TZC1LPEN		BIT(11)
#define RCC_MC_APB5LPENCLRR_TZC2LPEN		BIT(12)
#define RCC_MC_APB5LPENCLRR_TZPCLPEN		BIT(13)
#define RCC_MC_APB5LPENCLRR_BSECLPEN		BIT(16)
#define RCC_MC_APB5LPENCLRR_STGENLPEN		BIT(20)
#define RCC_MC_APB5LPENCLRR_STGENSTPEN		BIT(21)

/* RCC_MC_AHB5LPENSETR register fields */
#define RCC_MC_AHB5LPENSETR_GPIOZLPEN		BIT(0)
#define RCC_MC_AHB5LPENSETR_CRYP1LPEN		BIT(4)
#define RCC_MC_AHB5LPENSETR_HASH1LPEN		BIT(5)
#define RCC_MC_AHB5LPENSETR_RNG1LPEN		BIT(6)
#define RCC_MC_AHB5LPENSETR_BKPSRAMLPEN		BIT(8)

/* RCC_MC_AHB5LPENCLRR register fields */
#define RCC_MC_AHB5LPENCLRR_GPIOZLPEN		BIT(0)
#define RCC_MC_AHB5LPENCLRR_CRYP1LPEN		BIT(4)
#define RCC_MC_AHB5LPENCLRR_HASH1LPEN		BIT(5)
#define RCC_MC_AHB5LPENCLRR_RNG1LPEN		BIT(6)
#define RCC_MC_AHB5LPENCLRR_BKPSRAMLPEN		BIT(8)

/* RCC_MC_AHB6LPENSETR register fields */
#define RCC_MC_AHB6LPENSETR_MDMALPEN		BIT(0)
#define RCC_MC_AHB6LPENSETR_GPULPEN		BIT(5)
#define RCC_MC_AHB6LPENSETR_ETHCKLPEN		BIT(7)
#define RCC_MC_AHB6LPENSETR_ETHTXLPEN		BIT(8)
#define RCC_MC_AHB6LPENSETR_ETHRXLPEN		BIT(9)
#define RCC_MC_AHB6LPENSETR_ETHMACLPEN		BIT(10)
#define RCC_MC_AHB6LPENSETR_ETHSTPEN		BIT(11)
#define RCC_MC_AHB6LPENSETR_FMCLPEN		BIT(12)
#define RCC_MC_AHB6LPENSETR_QSPILPEN		BIT(14)
#define RCC_MC_AHB6LPENSETR_SDMMC1LPEN		BIT(16)
#define RCC_MC_AHB6LPENSETR_SDMMC2LPEN		BIT(17)
#define RCC_MC_AHB6LPENSETR_CRC1LPEN		BIT(20)
#define RCC_MC_AHB6LPENSETR_USBHLPEN		BIT(24)

/* RCC_MC_AHB6LPENCLRR register fields */
#define RCC_MC_AHB6LPENCLRR_MDMALPEN		BIT(0)
#define RCC_MC_AHB6LPENCLRR_GPULPEN		BIT(5)
#define RCC_MC_AHB6LPENCLRR_ETHCKLPEN		BIT(7)
#define RCC_MC_AHB6LPENCLRR_ETHTXLPEN		BIT(8)
#define RCC_MC_AHB6LPENCLRR_ETHRXLPEN		BIT(9)
#define RCC_MC_AHB6LPENCLRR_ETHMACLPEN		BIT(10)
#define RCC_MC_AHB6LPENCLRR_ETHSTPEN		BIT(11)
#define RCC_MC_AHB6LPENCLRR_FMCLPEN		BIT(12)
#define RCC_MC_AHB6LPENCLRR_QSPILPEN		BIT(14)
#define RCC_MC_AHB6LPENCLRR_SDMMC1LPEN		BIT(16)
#define RCC_MC_AHB6LPENCLRR_SDMMC2LPEN		BIT(17)
#define RCC_MC_AHB6LPENCLRR_CRC1LPEN		BIT(20)
#define RCC_MC_AHB6LPENCLRR_USBHLPEN		BIT(24)

/* RCC_BR_RSTSCLRR register fields */
#define RCC_BR_RSTSCLRR_PORRSTF			BIT(0)
#define RCC_BR_RSTSCLRR_BORRSTF			BIT(1)
#define RCC_BR_RSTSCLRR_PADRSTF			BIT(2)
#define RCC_BR_RSTSCLRR_HCSSRSTF		BIT(3)
#define RCC_BR_RSTSCLRR_VCORERSTF		BIT(4)
#define RCC_BR_RSTSCLRR_MPSYSRSTF		BIT(6)
#define RCC_BR_RSTSCLRR_MCSYSRSTF		BIT(7)
#define RCC_BR_RSTSCLRR_IWDG1RSTF		BIT(8)
#define RCC_BR_RSTSCLRR_IWDG2RSTF		BIT(9)
#define RCC_BR_RSTSCLRR_MPUP0RSTF		BIT(13)
#define RCC_BR_RSTSCLRR_MPUP1RSTF		BIT(14)

/* RCC_MP_GRSTCSETR register fields */
#define RCC_MP_GRSTCSETR_MPSYSRST		BIT(0)
#define RCC_MP_GRSTCSETR_MCURST			BIT(1)
#define RCC_MP_GRSTCSETR_MPUP0RST		BIT(4)
#define RCC_MP_GRSTCSETR_MPUP1RST		BIT(5)

/* RCC_MP_RSTSCLRR register fields */
#define RCC_MP_RSTSCLRR_PORRSTF			BIT(0)
#define RCC_MP_RSTSCLRR_BORRSTF			BIT(1)
#define RCC_MP_RSTSCLRR_PADRSTF			BIT(2)
#define RCC_MP_RSTSCLRR_HCSSRSTF		BIT(3)
#define RCC_MP_RSTSCLRR_VCORERSTF		BIT(4)
#define RCC_MP_RSTSCLRR_MPSYSRSTF		BIT(6)
#define RCC_MP_RSTSCLRR_MCSYSRSTF		BIT(7)
#define RCC_MP_RSTSCLRR_IWDG1RSTF		BIT(8)
#define RCC_MP_RSTSCLRR_IWDG2RSTF		BIT(9)
#define RCC_MP_RSTSCLRR_STDBYRSTF		BIT(11)
#define RCC_MP_RSTSCLRR_CSTDBYRSTF		BIT(12)
#define RCC_MP_RSTSCLRR_MPUP0RSTF		BIT(13)
#define RCC_MP_RSTSCLRR_MPUP1RSTF		BIT(14)
#define RCC_MP_RSTSCLRR_SPARE			BIT(15)

/* RCC_MP_IWDGFZSETR register fields */
#define RCC_MP_IWDGFZSETR_FZ_IWDG1		BIT(0)
#define RCC_MP_IWDGFZSETR_FZ_IWDG2		BIT(1)

/* RCC_MP_IWDGFZCLRR register fields */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1		BIT(0)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2		BIT(1)

/* RCC_MP_CIER register fields */
#define RCC_MP_CIER_LSIRDYIE			BIT(0)
#define RCC_MP_CIER_LSERDYIE			BIT(1)
#define RCC_MP_CIER_HSIRDYIE			BIT(2)
#define RCC_MP_CIER_HSERDYIE			BIT(3)
#define RCC_MP_CIER_CSIRDYIE			BIT(4)
#define RCC_MP_CIER_PLL1DYIE			BIT(8)
#define RCC_MP_CIER_PLL2DYIE			BIT(9)
#define RCC_MP_CIER_PLL3DYIE			BIT(10)
#define RCC_MP_CIER_PLL4DYIE			BIT(11)
#define RCC_MP_CIER_LSECSSIE			BIT(16)
#define RCC_MP_CIER_WKUPIE			BIT(20)

/* RCC_MP_CIFR register fields */
#define RCC_MP_CIFR_MASK			U(0x110F1F)
#define RCC_MP_CIFR_LSIRDYF			BIT(0)
#define RCC_MP_CIFR_LSERDYF			BIT(1)
#define RCC_MP_CIFR_HSIRDYF			BIT(2)
#define RCC_MP_CIFR_HSERDYF			BIT(3)
#define RCC_MP_CIFR_CSIRDYF			BIT(4)
#define RCC_MP_CIFR_PLL1DYF			BIT(8)
#define RCC_MP_CIFR_PLL2DYF			BIT(9)
#define RCC_MP_CIFR_PLL3DYF			BIT(10)
#define RCC_MP_CIFR_PLL4DYF			BIT(11)
#define RCC_MP_CIFR_LSECSSF			BIT(16)
#define RCC_MP_CIFR_WKUPF			BIT(20)

/* RCC_PWRLPDLYCR register fields */
#define RCC_PWRLPDLYCR_PWRLP_DLY_MASK		GENMASK(21, 0)
#define RCC_PWRLPDLYCR_PWRLP_DLY_SHIFT		0
#define RCC_PWRLPDLYCR_MCTMPSKP			BIT(24)

/* RCC_MP_RSTSSETR register fields */
#define RCC_MP_RSTSSETR_PORRSTF			BIT(0)
#define RCC_MP_RSTSSETR_BORRSTF			BIT(1)
#define RCC_MP_RSTSSETR_PADRSTF			BIT(2)
#define RCC_MP_RSTSSETR_HCSSRSTF		BIT(3)
#define RCC_MP_RSTSSETR_VCORERSTF		BIT(4)
#define RCC_MP_RSTSSETR_MPSYSRSTF		BIT(6)
#define RCC_MP_RSTSSETR_MCSYSRSTF		BIT(7)
#define RCC_MP_RSTSSETR_IWDG1RSTF		BIT(8)
#define RCC_MP_RSTSSETR_IWDG2RSTF		BIT(9)
#define RCC_MP_RSTSSETR_STDBYRSTF		BIT(11)
#define RCC_MP_RSTSSETR_CSTDBYRSTF		BIT(12)
#define RCC_MP_RSTSSETR_MPUP0RSTF		BIT(13)
#define RCC_MP_RSTSSETR_MPUP1RSTF		BIT(14)
#define RCC_MP_RSTSSETR_SPARE			BIT(15)

/* RCC_MCO1CFGR register fields */
#define RCC_MCO1CFGR_MCO1SEL_MASK		GENMASK(2, 0)
#define RCC_MCO1CFGR_MCO1SEL_SHIFT		0
#define RCC_MCO1CFGR_MCO1DIV_MASK		GENMASK(7, 4)
#define RCC_MCO1CFGR_MCO1DIV_SHIFT		4
#define RCC_MCO1CFGR_MCO1ON			BIT(12)

/* RCC_MCO2CFGR register fields */
#define RCC_MCO2CFGR_MCO2SEL_MASK		GENMASK(2, 0)
#define RCC_MCO2CFGR_MCO2SEL_SHIFT		0
#define RCC_MCO2CFGR_MCO2DIV_MASK		GENMASK(7, 4)
#define RCC_MCO2CFGR_MCO2DIV_SHIFT		4
#define RCC_MCO2CFGR_MCO2ON			BIT(12)

/* RCC_OCRDYR register fields */
#define RCC_OCRDYR_HSIRDY			BIT(0)
#define RCC_OCRDYR_HSIDIVRDY			BIT(2)
#define RCC_OCRDYR_CSIRDY			BIT(4)
#define RCC_OCRDYR_HSERDY			BIT(8)
#define RCC_OCRDYR_MPUCKRDY			BIT(23)
#define RCC_OCRDYR_AXICKRDY			BIT(24)
#define RCC_OCRDYR_CKREST			BIT(25)

