ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_AHB2RSTCLRR register fields */
#define RCC_AHB2RSTCLRR_DMA1RST			BIT(0)
#define RCC_AHB2RSTCLRR_DMA2RST			BIT(1)
#define RCC_AHB2RSTCLRR_DMAMUXRST		BIT(2)
#define RCC_AHB2RSTCLRR_ADC12RST		BIT(5)
#define RCC_AHB2RSTCLRR_USBORST			BIT(8)
#define RCC_AHB2RSTCLRR_SDMMC3RST		BIT(16)

/* RCC_AHB3RSTSETR register fields */
#define RCC_AHB3RSTSETR_DCMIRST			BIT(0)
#define RCC_AHB3RSTSETR_CRYP2RST		BIT(4)
#define RCC_AHB3RSTSETR_HASH2RST		BIT(5)
#define RCC_AHB3RSTSETR_RNG2RST			BIT(6)
#define RCC_AHB3RSTSETR_CRC2RST			BIT(7)
#define RCC_AHB3RSTSETR_HSEMRST			BIT(11)
#define RCC_AHB3RSTSETR_IPCCRST			BIT(12)

/* RCC_AHB3RSTCLRR register fields */
#define RCC_AHB3RSTCLRR_DCMIRST			BIT(0)
#define RCC_AHB3RSTCLRR_CRYP2RST		BIT(4)
#define RCC_AHB3RSTCLRR_HASH2RST		BIT(5)
#define RCC_AHB3RSTCLRR_RNG2RST			BIT(6)
#define RCC_AHB3RSTCLRR_CRC2RST			BIT(7)
#define RCC_AHB3RSTCLRR_HSEMRST			BIT(11)
#define RCC_AHB3RSTCLRR_IPCCRST			BIT(12)

/* RCC_AHB4RSTSETR register fields */
#define RCC_AHB4RSTSETR_GPIOARST		BIT(0)
#define RCC_AHB4RSTSETR_GPIOBRST		BIT(1)
#define RCC_AHB4RSTSETR_GPIOCRST		BIT(2)
#define RCC_AHB4RSTSETR_GPIODRST		BIT(3)
#define RCC_AHB4RSTSETR_GPIOERST		BIT(4)
#define RCC_AHB4RSTSETR_GPIOFRST		BIT(5)
#define RCC_AHB4RSTSETR_GPIOGRST		BIT(6)
#define RCC_AHB4RSTSETR_GPIOHRST		BIT(7)
#define RCC_AHB4RSTSETR_GPIOIRST		BIT(8)
#define RCC_AHB4RSTSETR_GPIOJRST		BIT(9)
#define RCC_AHB4RSTSETR_GPIOKRST		BIT(10)

/* RCC_AHB4RSTCLRR register fields */
#define RCC_AHB4RSTCLRR_GPIOARST		BIT(0)
#define RCC_AHB4RSTCLRR_GPIOBRST		BIT(1)
#define RCC_AHB4RSTCLRR_GPIOCRST		BIT(2)
#define RCC_AHB4RSTCLRR_GPIODRST		BIT(3)
#define RCC_AHB4RSTCLRR_GPIOERST		BIT(4)
#define RCC_AHB4RSTCLRR_GPIOFRST		BIT(5)
#define RCC_AHB4RSTCLRR_GPIOGRST		BIT(6)
#define RCC_AHB4RSTCLRR_GPIOHRST		BIT(7)
#define RCC_AHB4RSTCLRR_GPIOIRST		BIT(8)
#define RCC_AHB4RSTCLRR_GPIOJRST		BIT(9)
#define RCC_AHB4RSTCLRR_GPIOKRST		BIT(10)

/* RCC_MP_APB1ENSETR register fields */
#define RCC_MP_APB1ENSETR_TIM2EN		BIT(0)
#define RCC_MP_APB1ENSETR_TIM3EN		BIT(1)
#define RCC_MP_APB1ENSETR_TIM4EN		BIT(2)
#define RCC_MP_APB1ENSETR_TIM5EN		BIT(3)
#define RCC_MP_APB1ENSETR_TIM6EN		BIT(4)
#define RCC_MP_APB1ENSETR_TIM7EN		BIT(5)
#define RCC_MP_APB1ENSETR_TIM12EN		BIT(6)
#define RCC_MP_APB1ENSETR_TIM13EN		BIT(7)
#define RCC_MP_APB1ENSETR_TIM14EN		BIT(8)
#define RCC_MP_APB1ENSETR_LPTIM1EN		BIT(9)
#define RCC_MP_APB1ENSETR_SPI2EN		BIT(11)
#define RCC_MP_APB1ENSETR_SPI3EN		BIT(12)
#define RCC_MP_APB1ENSETR_USART2EN		BIT(14)
#define RCC_MP_APB1ENSETR_USART3EN		BIT(15)
#define RCC_MP_APB1ENSETR_UART4EN		BIT(16)
#define RCC_MP_APB1ENSETR_UART5EN		BIT(17)
#define RCC_MP_APB1ENSETR_UART7EN		BIT(18)
#define RCC_MP_APB1ENSETR_UART8EN		BIT(19)
#define RCC_MP_APB1ENSETR_I2C1EN		BIT(21)
#define RCC_MP_APB1ENSETR_I2C2EN		BIT(22)
#define RCC_MP_APB1ENSETR_I2C3EN		BIT(23)
#define RCC_MP_APB1ENSETR_I2C5EN		BIT(24)
#define RCC_MP_APB1ENSETR_SPDIFEN		BIT(26)
#define RCC_MP_APB1ENSETR_CECEN			BIT(27)
#define RCC_MP_APB1ENSETR_DAC12EN		BIT(29)
#define RCC_MP_APB1ENSETR_MDIOSEN		BIT(31)

/* RCC_MP_APB1ENCLRR register fields */
#define RCC_MP_APB1ENCLRR_TIM2EN		BIT(0)
#define RCC_MP_APB1ENCLRR_TIM3EN		BIT(1)
#define RCC_MP_APB1ENCLRR_TIM4EN		BIT(2)
#define RCC_MP_APB1ENCLRR_TIM5EN		BIT(3)
#define RCC_MP_APB1ENCLRR_TIM6EN		BIT(4)
#define RCC_MP_APB1ENCLRR_TIM7EN		BIT(5)
#define RCC_MP_APB1ENCLRR_TIM12EN		BIT(6)
#define RCC_MP_APB1ENCLRR_TIM13EN		BIT(7)
#define RCC_MP_APB1ENCLRR_TIM14EN		BIT(8)
#define RCC_MP_APB1ENCLRR_LPTIM1EN		BIT(9)
#define RCC_MP_APB1ENCLRR_SPI2EN		BIT(11)
#define RCC_MP_APB1ENCLRR_SPI3EN		BIT(12)
#define RCC_MP_APB1ENCLRR_USART2EN		BIT(14)
#define RCC_MP_APB1ENCLRR_USART3EN		BIT(15)
#define RCC_MP_APB1ENCLRR_UART4EN		BIT(16)
#define RCC_MP_APB1ENCLRR_UART5EN		BIT(17)
#define RCC_MP_APB1ENCLRR_UART7EN		BIT(18)
#define RCC_MP_APB1ENCLRR_UART8EN		BIT(19)
#define RCC_MP_APB1ENCLRR_I2C1EN		BIT(21)
#define RCC_MP_APB1ENCLRR_I2C2EN		BIT(22)
#define RCC_MP_APB1ENCLRR_I2C3EN		BIT(23)
#define RCC_MP_APB1ENCLRR_I2C5EN		BIT(24)
#define RCC_MP_APB1ENCLRR_SPDIFEN		BIT(26)
#define RCC_MP_APB1ENCLRR_CECEN			BIT(27)
#define RCC_MP_APB1ENCLRR_DAC12EN		BIT(29)
#define RCC_MP_APB1ENCLRR_MDIOSEN		BIT(31)

/* RCC_MP_APB2ENSETR register fields */
#define RCC_MP_APB2ENSETR_TIM1EN		BIT(0)
#define RCC_MP_APB2ENSETR_TIM8EN		BIT(1)
#define RCC_MP_APB2ENSETR_TIM15EN		BIT(2)
#define RCC_MP_APB2ENSETR_TIM16EN		BIT(3)
#define RCC_MP_APB2ENSETR_TIM17EN		BIT(4)
#define RCC_MP_APB2ENSETR_SPI1EN		BIT(8)
#define RCC_MP_APB2ENSETR_SPI4EN		BIT(9)
#define RCC_MP_APB2ENSETR_SPI5EN		BIT(10)
#define RCC_MP_APB2ENSETR_USART6EN		BIT(13)
#define RCC_MP_APB2ENSETR_SAI1EN		BIT(16)
#define RCC_MP_APB2ENSETR_SAI2EN		BIT(17)
#define RCC_MP_APB2ENSETR_SAI3EN		BIT(18)
#define RCC_MP_APB2ENSETR_DFSDMEN		BIT(20)
#define RCC_MP_APB2ENSETR_ADFSDMEN		BIT(21)
#define RCC_MP_APB2ENSETR_FDCANEN		BIT(24)

/* RCC_MP_APB2ENCLRR register fields */
#define RCC_MP_APB2ENCLRR_TIM1EN		BIT(0)
#define RCC_MP_APB2ENCLRR_TIM8EN		BIT(1)
#define RCC_MP_APB2ENCLRR_TIM15EN		BIT(2)
#define RCC_MP_APB2ENCLRR_TIM16EN		BIT(3)
#define RCC_MP_APB2ENCLRR_TIM17EN		BIT(4)
#define RCC_MP_APB2ENCLRR_SPI1EN		BIT(8)
#define RCC_MP_APB2ENCLRR_SPI4EN		BIT(9)
#define RCC_MP_APB2ENCLRR_SPI5EN		BIT(10)
#define RCC_MP_APB2ENCLRR_USART6EN		BIT(13)
#define RCC_MP_APB2ENCLRR_SAI1EN		BIT(16)
#define RCC_MP_APB2ENCLRR_SAI2EN		BIT(17)
#define RCC_MP_APB2ENCLRR_SAI3EN		BIT(18)
#define RCC_MP_APB2ENCLRR_DFSDMEN		BIT(20)
#define RCC_MP_APB2ENCLRR_ADFSDMEN		BIT(21)
#define RCC_MP_APB2ENCLRR_FDCANEN		BIT(24)

/* RCC_MP_APB3ENSETR register fields */
#define RCC_MP_APB3ENSETR_LPTIM2EN		BIT(0)
#define RCC_MP_APB3ENSETR_LPTIM3EN		BIT(1)
#define RCC_MP_APB3ENSETR_LPTIM4EN		BIT(2)
#define RCC_MP_APB3ENSETR_LPTIM5EN		BIT(3)
#define RCC_MP_APB3ENSETR_SAI4EN		BIT(8)
#define RCC_MP_APB3ENSETR_SYSCFGEN		BIT(11)
#define RCC_MP_APB3ENSETR_VREFEN		BIT(13)
#define RCC_MP_APB3ENSETR_TMPSENSEN		BIT(16)
#define RCC_MP_APB3ENSETR_PMBCTRLEN		BIT(17)
#define RCC_MP_APB3ENSETR_HDPEN			BIT(20)

/* RCC_MP_APB3ENCLRR register fields */
#define RCC_MP_APB3ENCLRR_LPTIM2EN		BIT(0)
#define RCC_MP_APB3ENCLRR_LPTIM3EN		BIT(1)
#define RCC_MP_APB3ENCLRR_LPTIM4EN		BIT(2)
#define RCC_MP_APB3ENCLRR_LPTIM5EN		BIT(3)
#define RCC_MP_APB3ENCLRR_SAI4EN		BIT(8)
#define RCC_MP_APB3ENCLRR_SYSCFGEN		BIT(11)
#define RCC_MP_APB3ENCLRR_VREFEN		BIT(13)
#define RCC_MP_APB3ENCLRR_TMPSENSEN		BIT(16)
#define RCC_MP_APB3ENCLRR_PMBCTRLEN		BIT(17)
#define RCC_MP_APB3ENCLRR_HDPEN			BIT(20)

