ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MP_AHB2ENSETR register fields */
#define RCC_MP_AHB2ENSETR_DMA1EN		BIT(0)
#define RCC_MP_AHB2ENSETR_DMA2EN		BIT(1)
#define RCC_MP_AHB2ENSETR_DMAMUXEN		BIT(2)
#define RCC_MP_AHB2ENSETR_ADC12EN		BIT(5)
#define RCC_MP_AHB2ENSETR_USBOEN		BIT(8)
#define RCC_MP_AHB2ENSETR_SDMMC3EN		BIT(16)

/* RCC_MP_AHB2ENCLRR register fields */
#define RCC_MP_AHB2ENCLRR_DMA1EN		BIT(0)
#define RCC_MP_AHB2ENCLRR_DMA2EN		BIT(1)
#define RCC_MP_AHB2ENCLRR_DMAMUXEN		BIT(2)
#define RCC_MP_AHB2ENCLRR_ADC12EN		BIT(5)
#define RCC_MP_AHB2ENCLRR_USBOEN		BIT(8)
#define RCC_MP_AHB2ENCLRR_SDMMC3EN		BIT(16)

/* RCC_MP_AHB3ENSETR register fields */
#define RCC_MP_AHB3ENSETR_DCMIEN		BIT(0)
#define RCC_MP_AHB3ENSETR_CRYP2EN		BIT(4)
#define RCC_MP_AHB3ENSETR_HASH2EN		BIT(5)
#define RCC_MP_AHB3ENSETR_RNG2EN		BIT(6)
#define RCC_MP_AHB3ENSETR_CRC2EN		BIT(7)
#define RCC_MP_AHB3ENSETR_HSEMEN		BIT(11)
#define RCC_MP_AHB3ENSETR_IPCCEN		BIT(12)

/* RCC_MP_AHB3ENCLRR register fields */
#define RCC_MP_AHB3ENCLRR_DCMIEN		BIT(0)
#define RCC_MP_AHB3ENCLRR_CRYP2EN		BIT(4)
#define RCC_MP_AHB3ENCLRR_HASH2EN		BIT(5)
#define RCC_MP_AHB3ENCLRR_RNG2EN		BIT(6)
#define RCC_MP_AHB3ENCLRR_CRC2EN		BIT(7)
#define RCC_MP_AHB3ENCLRR_HSEMEN		BIT(11)
#define RCC_MP_AHB3ENCLRR_IPCCEN		BIT(12)

/* RCC_MP_AHB4ENSETR register fields */
#define RCC_MP_AHB4ENSETR_GPIOAEN		BIT(0)
#define RCC_MP_AHB4ENSETR_GPIOBEN		BIT(1)
#define RCC_MP_AHB4ENSETR_GPIOCEN		BIT(2)
#define RCC_MP_AHB4ENSETR_GPIODEN		BIT(3)
#define RCC_MP_AHB4ENSETR_GPIOEEN		BIT(4)
#define RCC_MP_AHB4ENSETR_GPIOFEN		BIT(5)
#define RCC_MP_AHB4ENSETR_GPIOGEN		BIT(6)
#define RCC_MP_AHB4ENSETR_GPIOHEN		BIT(7)
#define RCC_MP_AHB4ENSETR_GPIOIEN		BIT(8)
#define RCC_MP_AHB4ENSETR_GPIOJEN		BIT(9)
#define RCC_MP_AHB4ENSETR_GPIOKEN		BIT(10)

/* RCC_MP_AHB4ENCLRR register fields */
#define RCC_MP_AHB4ENCLRR_GPIOAEN		BIT(0)
#define RCC_MP_AHB4ENCLRR_GPIOBEN		BIT(1)
#define RCC_MP_AHB4ENCLRR_GPIOCEN		BIT(2)
#define RCC_MP_AHB4ENCLRR_GPIODEN		BIT(3)
#define RCC_MP_AHB4ENCLRR_GPIOEEN		BIT(4)
#define RCC_MP_AHB4ENCLRR_GPIOFEN		BIT(5)
#define RCC_MP_AHB4ENCLRR_GPIOGEN		BIT(6)
#define RCC_MP_AHB4ENCLRR_GPIOHEN		BIT(7)
#define RCC_MP_AHB4ENCLRR_GPIOIEN		BIT(8)
#define RCC_MP_AHB4ENCLRR_GPIOJEN		BIT(9)
#define RCC_MP_AHB4ENCLRR_GPIOKEN		BIT(10)

/* RCC_MP_MLAHBENSETR register fields */
#define RCC_MP_MLAHBENSETR_RETRAMEN		BIT(4)

/* RCC_MP_MLAHBENCLRR register fields */
#define RCC_MP_MLAHBENCLRR_RETRAMEN		BIT(4)

/* RCC_MC_APB1ENSETR register fields */
#define RCC_MC_APB1ENSETR_TIM2EN		BIT(0)
#define RCC_MC_APB1ENSETR_TIM3EN		BIT(1)
#define RCC_MC_APB1ENSETR_TIM4EN		BIT(2)
#define RCC_MC_APB1ENSETR_TIM5EN		BIT(3)
#define RCC_MC_APB1ENSETR_TIM6EN		BIT(4)
#define RCC_MC_APB1ENSETR_TIM7EN		BIT(5)
#define RCC_MC_APB1ENSETR_TIM12EN		BIT(6)
#define RCC_MC_APB1ENSETR_TIM13EN		BIT(7)
#define RCC_MC_APB1ENSETR_TIM14EN		BIT(8)
#define RCC_MC_APB1ENSETR_LPTIM1EN		BIT(9)
#define RCC_MC_APB1ENSETR_SPI2EN		BIT(11)
#define RCC_MC_APB1ENSETR_SPI3EN		BIT(12)
#define RCC_MC_APB1ENSETR_USART2EN		BIT(14)
#define RCC_MC_APB1ENSETR_USART3EN		BIT(15)
#define RCC_MC_APB1ENSETR_UART4EN		BIT(16)
#define RCC_MC_APB1ENSETR_UART5EN		BIT(17)
#define RCC_MC_APB1ENSETR_UART7EN		BIT(18)
#define RCC_MC_APB1ENSETR_UART8EN		BIT(19)
#define RCC_MC_APB1ENSETR_I2C1EN		BIT(21)
#define RCC_MC_APB1ENSETR_I2C2EN		BIT(22)
#define RCC_MC_APB1ENSETR_I2C3EN		BIT(23)
#define RCC_MC_APB1ENSETR_I2C5EN		BIT(24)
#define RCC_MC_APB1ENSETR_SPDIFEN		BIT(26)
#define RCC_MC_APB1ENSETR_CECEN			BIT(27)
#define RCC_MC_APB1ENSETR_WWDG1EN		BIT(28)
#define RCC_MC_APB1ENSETR_DAC12EN		BIT(29)
#define RCC_MC_APB1ENSETR_MDIOSEN		BIT(31)

/* RCC_MC_APB1ENCLRR register fields */
#define RCC_MC_APB1ENCLRR_TIM2EN		BIT(0)
#define RCC_MC_APB1ENCLRR_TIM3EN		BIT(1)
#define RCC_MC_APB1ENCLRR_TIM4EN		BIT(2)
#define RCC_MC_APB1ENCLRR_TIM5EN		BIT(3)
#define RCC_MC_APB1ENCLRR_TIM6EN		BIT(4)
#define RCC_MC_APB1ENCLRR_TIM7EN		BIT(5)
#define RCC_MC_APB1ENCLRR_TIM12EN		BIT(6)
#define RCC_MC_APB1ENCLRR_TIM13EN		BIT(7)
#define RCC_MC_APB1ENCLRR_TIM14EN		BIT(8)
#define RCC_MC_APB1ENCLRR_LPTIM1EN		BIT(9)
#define RCC_MC_APB1ENCLRR_SPI2EN		BIT(11)
#define RCC_MC_APB1ENCLRR_SPI3EN		BIT(12)
#define RCC_MC_APB1ENCLRR_USART2EN		BIT(14)
#define RCC_MC_APB1ENCLRR_USART3EN		BIT(15)
#define RCC_MC_APB1ENCLRR_UART4EN		BIT(16)
#define RCC_MC_APB1ENCLRR_UART5EN		BIT(17)
#define RCC_MC_APB1ENCLRR_UART7EN		BIT(18)
#define RCC_MC_APB1ENCLRR_UART8EN		BIT(19)
#define RCC_MC_APB1ENCLRR_I2C1EN		BIT(21)
#define RCC_MC_APB1ENCLRR_I2C2EN		BIT(22)
#define RCC_MC_APB1ENCLRR_I2C3EN		BIT(23)
#define RCC_MC_APB1ENCLRR_I2C5EN		BIT(24)
#define RCC_MC_APB1ENCLRR_SPDIFEN		BIT(26)
#define RCC_MC_APB1ENCLRR_CECEN			BIT(27)
#define RCC_MC_APB1ENCLRR_DAC12EN		BIT(29)
#define RCC_MC_APB1ENCLRR_MDIOSEN		BIT(31)

/* RCC_MC_APB2ENSETR register fields */
#define RCC_MC_APB2ENSETR_TIM1EN		BIT(0)
#define RCC_MC_APB2ENSETR_TIM8EN		BIT(1)
#define RCC_MC_APB2ENSETR_TIM15EN		BIT(2)
#define RCC_MC_APB2ENSETR_TIM16EN		BIT(3)
#define RCC_MC_APB2ENSETR_TIM17EN		BIT(4)
#define RCC_MC_APB2ENSETR_SPI1EN		BIT(8)
#define RCC_MC_APB2ENSETR_SPI4EN		BIT(9)
#define RCC_MC_APB2ENSETR_SPI5EN		BIT(10)
#define RCC_MC_APB2ENSETR_USART6EN		BIT(13)
#define RCC_MC_APB2ENSETR_SAI1EN		BIT(16)
#define RCC_MC_APB2ENSETR_SAI2EN		BIT(17)
#define RCC_MC_APB2ENSETR_SAI3EN		BIT(18)
#define RCC_MC_APB2ENSETR_DFSDMEN		BIT(20)
#define RCC_MC_APB2ENSETR_ADFSDMEN		BIT(21)
#define RCC_MC_APB2ENSETR_FDCANEN		BIT(24)

/* RCC_MC_APB2ENCLRR register fields */
#define RCC_MC_APB2ENCLRR_TIM1EN		BIT(0)
#define RCC_MC_APB2ENCLRR_TIM8EN		BIT(1)
#define RCC_MC_APB2ENCLRR_TIM15EN		BIT(2)
#define RCC_MC_APB2ENCLRR_TIM16EN		BIT(3)
#define RCC_MC_APB2ENCLRR_TIM17EN		BIT(4)
#define RCC_MC_APB2ENCLRR_SPI1EN		BIT(8)
#define RCC_MC_APB2ENCLRR_SPI4EN		BIT(9)
#define RCC_MC_APB2ENCLRR_SPI5EN		BIT(10)
#define RCC_MC_APB2ENCLRR_USART6EN		BIT(13)
#define RCC_MC_APB2ENCLRR_SAI1EN		BIT(16)
#define RCC_MC_APB2ENCLRR_SAI2EN		BIT(17)
#define RCC_MC_APB2ENCLRR_SAI3EN		BIT(18)
#define RCC_MC_APB2ENCLRR_DFSDMEN		BIT(20)
#define RCC_MC_APB2ENCLRR_ADFSDMEN		BIT(21)
#define RCC_MC_APB2ENCLRR_FDCANEN		BIT(24)

