ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MC_APB3ENSETR register fields */
#define RCC_MC_APB3ENSETR_LPTIM2EN		BIT(0)
#define RCC_MC_APB3ENSETR_LPTIM3EN		BIT(1)
#define RCC_MC_APB3ENSETR_LPTIM4EN		BIT(2)
#define RCC_MC_APB3ENSETR_LPTIM5EN		BIT(3)
#define RCC_MC_APB3ENSETR_SAI4EN		BIT(8)
#define RCC_MC_APB3ENSETR_SYSCFGEN		BIT(11)
#define RCC_MC_APB3ENSETR_VREFEN		BIT(13)
#define RCC_MC_APB3ENSETR_TMPSENSEN		BIT(16)
#define RCC_MC_APB3ENSETR_PMBCTRLEN		BIT(17)
#define RCC_MC_APB3ENSETR_HDPEN			BIT(20)

/* RCC_MC_APB3ENCLRR register fields */
#define RCC_MC_APB3ENCLRR_LPTIM2EN		BIT(0)
#define RCC_MC_APB3ENCLRR_LPTIM3EN		BIT(1)
#define RCC_MC_APB3ENCLRR_LPTIM4EN		BIT(2)
#define RCC_MC_APB3ENCLRR_LPTIM5EN		BIT(3)
#define RCC_MC_APB3ENCLRR_SAI4EN		BIT(8)
#define RCC_MC_APB3ENCLRR_SYSCFGEN		BIT(11)
#define RCC_MC_APB3ENCLRR_VREFEN		BIT(13)
#define RCC_MC_APB3ENCLRR_TMPSENSEN		BIT(16)
#define RCC_MC_APB3ENCLRR_PMBCTRLEN		BIT(17)
#define RCC_MC_APB3ENCLRR_HDPEN			BIT(20)

/* RCC_MC_AHB2ENSETR register fields */
#define RCC_MC_AHB2ENSETR_DMA1EN		BIT(0)
#define RCC_MC_AHB2ENSETR_DMA2EN		BIT(1)
#define RCC_MC_AHB2ENSETR_DMAMUXEN		BIT(2)
#define RCC_MC_AHB2ENSETR_ADC12EN		BIT(5)
#define RCC_MC_AHB2ENSETR_USBOEN		BIT(8)
#define RCC_MC_AHB2ENSETR_SDMMC3EN		BIT(16)

/* RCC_MC_AHB2ENCLRR register fields */
#define RCC_MC_AHB2ENCLRR_DMA1EN		BIT(0)
#define RCC_MC_AHB2ENCLRR_DMA2EN		BIT(1)
#define RCC_MC_AHB2ENCLRR_DMAMUXEN		BIT(2)
#define RCC_MC_AHB2ENCLRR_ADC12EN		BIT(5)
#define RCC_MC_AHB2ENCLRR_USBOEN		BIT(8)
#define RCC_MC_AHB2ENCLRR_SDMMC3EN		BIT(16)

/* RCC_MC_AHB3ENSETR register fields */
#define RCC_MC_AHB3ENSETR_DCMIEN		BIT(0)
#define RCC_MC_AHB3ENSETR_CRYP2EN		BIT(4)
#define RCC_MC_AHB3ENSETR_HASH2EN		BIT(5)
#define RCC_MC_AHB3ENSETR_RNG2EN		BIT(6)
#define RCC_MC_AHB3ENSETR_CRC2EN		BIT(7)
#define RCC_MC_AHB3ENSETR_HSEMEN		BIT(11)
#define RCC_MC_AHB3ENSETR_IPCCEN		BIT(12)

/* RCC_MC_AHB3ENCLRR register fields */
#define RCC_MC_AHB3ENCLRR_DCMIEN		BIT(0)
#define RCC_MC_AHB3ENCLRR_CRYP2EN		BIT(4)
#define RCC_MC_AHB3ENCLRR_HASH2EN		BIT(5)
#define RCC_MC_AHB3ENCLRR_RNG2EN		BIT(6)
#define RCC_MC_AHB3ENCLRR_CRC2EN		BIT(7)
#define RCC_MC_AHB3ENCLRR_HSEMEN		BIT(11)
#define RCC_MC_AHB3ENCLRR_IPCCEN		BIT(12)

/* RCC_MC_AHB4ENSETR register fields */
#define RCC_MC_AHB4ENSETR_GPIOAEN		BIT(0)
#define RCC_MC_AHB4ENSETR_GPIOBEN		BIT(1)
#define RCC_MC_AHB4ENSETR_GPIOCEN		BIT(2)
#define RCC_MC_AHB4ENSETR_GPIODEN		BIT(3)
#define RCC_MC_AHB4ENSETR_GPIOEEN		BIT(4)
#define RCC_MC_AHB4ENSETR_GPIOFEN		BIT(5)
#define RCC_MC_AHB4ENSETR_GPIOGEN		BIT(6)
#define RCC_MC_AHB4ENSETR_GPIOHEN		BIT(7)
#define RCC_MC_AHB4ENSETR_GPIOIEN		BIT(8)
#define RCC_MC_AHB4ENSETR_GPIOJEN		BIT(9)
#define RCC_MC_AHB4ENSETR_GPIOKEN		BIT(10)

/* RCC_MC_AHB4ENCLRR register fields */
#define RCC_MC_AHB4ENCLRR_GPIOAEN		BIT(0)
#define RCC_MC_AHB4ENCLRR_GPIOBEN		BIT(1)
#define RCC_MC_AHB4ENCLRR_GPIOCEN		BIT(2)
#define RCC_MC_AHB4ENCLRR_GPIODEN		BIT(3)
#define RCC_MC_AHB4ENCLRR_GPIOEEN		BIT(4)
#define RCC_MC_AHB4ENCLRR_GPIOFEN		BIT(5)
#define RCC_MC_AHB4ENCLRR_GPIOGEN		BIT(6)
#define RCC_MC_AHB4ENCLRR_GPIOHEN		BIT(7)
#define RCC_MC_AHB4ENCLRR_GPIOIEN		BIT(8)
#define RCC_MC_AHB4ENCLRR_GPIOJEN		BIT(9)
#define RCC_MC_AHB4ENCLRR_GPIOKEN		BIT(10)

/* RCC_MC_AXIMENSETR register fields */
#define RCC_MC_AXIMENSETR_SYSRAMEN		BIT(0)

/* RCC_MC_AXIMENCLRR register fields */
#define RCC_MC_AXIMENCLRR_SYSRAMEN		BIT(0)

/* RCC_MC_MLAHBENSETR register fields */
#define RCC_MC_MLAHBENSETR_RETRAMEN		BIT(4)

/* RCC_MC_MLAHBENCLRR register fields */
#define RCC_MC_MLAHBENCLRR_RETRAMEN		BIT(4)

/* RCC_MP_APB1LPENSETR register fields */
#define RCC_MP_APB1LPENSETR_TIM2LPEN		BIT(0)
#define RCC_MP_APB1LPENSETR_TIM3LPEN		BIT(1)
#define RCC_MP_APB1LPENSETR_TIM4LPEN		BIT(2)
#define RCC_MP_APB1LPENSETR_TIM5LPEN		BIT(3)
#define RCC_MP_APB1LPENSETR_TIM6LPEN		BIT(4)
#define RCC_MP_APB1LPENSETR_TIM7LPEN		BIT(5)
#define RCC_MP_APB1LPENSETR_TIM12LPEN		BIT(6)
#define RCC_MP_APB1LPENSETR_TIM13LPEN		BIT(7)
#define RCC_MP_APB1LPENSETR_TIM14LPEN		BIT(8)
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN		BIT(9)
#define RCC_MP_APB1LPENSETR_SPI2LPEN		BIT(11)
#define RCC_MP_APB1LPENSETR_SPI3LPEN		BIT(12)
#define RCC_MP_APB1LPENSETR_USART2LPEN		BIT(14)
#define RCC_MP_APB1LPENSETR_USART3LPEN		BIT(15)
#define RCC_MP_APB1LPENSETR_UART4LPEN		BIT(16)
#define RCC_MP_APB1LPENSETR_UART5LPEN		BIT(17)
#define RCC_MP_APB1LPENSETR_UART7LPEN		BIT(18)
#define RCC_MP_APB1LPENSETR_UART8LPEN		BIT(19)
#define RCC_MP_APB1LPENSETR_I2C1LPEN		BIT(21)
#define RCC_MP_APB1LPENSETR_I2C2LPEN		BIT(22)
#define RCC_MP_APB1LPENSETR_I2C3LPEN		BIT(23)
#define RCC_MP_APB1LPENSETR_I2C5LPEN		BIT(24)
#define RCC_MP_APB1LPENSETR_SPDIFLPEN		BIT(26)
#define RCC_MP_APB1LPENSETR_CECLPEN		BIT(27)
#define RCC_MP_APB1LPENSETR_DAC12LPEN		BIT(29)
#define RCC_MP_APB1LPENSETR_MDIOSLPEN		BIT(31)

/* RCC_MP_APB1LPENCLRR register fields */
#define RCC_MP_APB1LPENCLRR_TIM2LPEN		BIT(0)
#define RCC_MP_APB1LPENCLRR_TIM3LPEN		BIT(1)
#define RCC_MP_APB1LPENCLRR_TIM4LPEN		BIT(2)
#define RCC_MP_APB1LPENCLRR_TIM5LPEN		BIT(3)
#define RCC_MP_APB1LPENCLRR_TIM6LPEN		BIT(4)
#define RCC_MP_APB1LPENCLRR_TIM7LPEN		BIT(5)
#define RCC_MP_APB1LPENCLRR_TIM12LPEN		BIT(6)
#define RCC_MP_APB1LPENCLRR_TIM13LPEN		BIT(7)
#define RCC_MP_APB1LPENCLRR_TIM14LPEN		BIT(8)
#define RCC_MP_APB1LPENCLRR_LPTIM1LPEN		BIT(9)
#define RCC_MP_APB1LPENCLRR_SPI2LPEN		BIT(11)
#define RCC_MP_APB1LPENCLRR_SPI3LPEN		BIT(12)
#define RCC_MP_APB1LPENCLRR_USART2LPEN		BIT(14)
#define RCC_MP_APB1LPENCLRR_USART3LPEN		BIT(15)
#define RCC_MP_APB1LPENCLRR_UART4LPEN		BIT(16)
#define RCC_MP_APB1LPENCLRR_UART5LPEN		BIT(17)
#define RCC_MP_APB1LPENCLRR_UART7LPEN		BIT(18)
#define RCC_MP_APB1LPENCLRR_UART8LPEN		BIT(19)
#define RCC_MP_APB1LPENCLRR_I2C1LPEN		BIT(21)
#define RCC_MP_APB1LPENCLRR_I2C2LPEN		BIT(22)
#define RCC_MP_APB1LPENCLRR_I2C3LPEN		BIT(23)
#define RCC_MP_APB1LPENCLRR_I2C5LPEN		BIT(24)
#define RCC_MP_APB1LPENCLRR_SPDIFLPEN		BIT(26)
#define RCC_MP_APB1LPENCLRR_CECLPEN		BIT(27)
#define RCC_MP_APB1LPENCLRR_DAC12LPEN		BIT(29)
#define RCC_MP_APB1LPENCLRR_MDIOSLPEN		BIT(31)

