ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MP_APB2LPENSETR register fields */
#define RCC_MP_APB2LPENSETR_TIM1LPEN		BIT(0)
#define RCC_MP_APB2LPENSETR_TIM8LPEN		BIT(1)
#define RCC_MP_APB2LPENSETR_TIM15LPEN		BIT(2)
#define RCC_MP_APB2LPENSETR_TIM16LPEN		BIT(3)
#define RCC_MP_APB2LPENSETR_TIM17LPEN		BIT(4)
#define RCC_MP_APB2LPENSETR_SPI1LPEN		BIT(8)
#define RCC_MP_APB2LPENSETR_SPI4LPEN		BIT(9)
#define RCC_MP_APB2LPENSETR_SPI5LPEN		BIT(10)
#define RCC_MP_APB2LPENSETR_USART6LPEN		BIT(13)
#define RCC_MP_APB2LPENSETR_SAI1LPEN		BIT(16)
#define RCC_MP_APB2LPENSETR_SAI2LPEN		BIT(17)
#define RCC_MP_APB2LPENSETR_SAI3LPEN		BIT(18)
#define RCC_MP_APB2LPENSETR_DFSDMLPEN		BIT(20)
#define RCC_MP_APB2LPENSETR_ADFSDMLPEN		BIT(21)
#define RCC_MP_APB2LPENSETR_FDCANLPEN		BIT(24)

/* RCC_MP_APB2LPENCLRR register fields */
#define RCC_MP_APB2LPENCLRR_TIM1LPEN		BIT(0)
#define RCC_MP_APB2LPENCLRR_TIM8LPEN		BIT(1)
#define RCC_MP_APB2LPENCLRR_TIM15LPEN		BIT(2)
#define RCC_MP_APB2LPENCLRR_TIM16LPEN		BIT(3)
#define RCC_MP_APB2LPENCLRR_TIM17LPEN		BIT(4)
#define RCC_MP_APB2LPENCLRR_SPI1LPEN		BIT(8)
#define RCC_MP_APB2LPENCLRR_SPI4LPEN		BIT(9)
#define RCC_MP_APB2LPENCLRR_SPI5LPEN		BIT(10)
#define RCC_MP_APB2LPENCLRR_USART6LPEN		BIT(13)
#define RCC_MP_APB2LPENCLRR_SAI1LPEN		BIT(16)
#define RCC_MP_APB2LPENCLRR_SAI2LPEN		BIT(17)
#define RCC_MP_APB2LPENCLRR_SAI3LPEN		BIT(18)
#define RCC_MP_APB2LPENCLRR_DFSDMLPEN		BIT(20)
#define RCC_MP_APB2LPENCLRR_ADFSDMLPEN		BIT(21)
#define RCC_MP_APB2LPENCLRR_FDCANLPEN		BIT(24)

/* RCC_MP_APB3LPENSETR register fields */
#define RCC_MP_APB3LPENSETR_LPTIM2LPEN		BIT(0)
#define RCC_MP_APB3LPENSETR_LPTIM3LPEN		BIT(1)
#define RCC_MP_APB3LPENSETR_LPTIM4LPEN		BIT(2)
#define RCC_MP_APB3LPENSETR_LPTIM5LPEN		BIT(3)
#define RCC_MP_APB3LPENSETR_SAI4LPEN		BIT(8)
#define RCC_MP_APB3LPENSETR_SYSCFGLPEN		BIT(11)
#define RCC_MP_APB3LPENSETR_VREFLPEN		BIT(13)
#define RCC_MP_APB3LPENSETR_TMPSENSLPEN		BIT(16)
#define RCC_MP_APB3LPENSETR_PMBCTRLLPEN		BIT(17)

/* RCC_MP_APB3LPENCLRR register fields */
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN		BIT(0)
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN		BIT(1)
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN		BIT(2)
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN		BIT(3)
#define RCC_MP_APB3LPENCLRR_SAI4LPEN		BIT(8)
#define RCC_MP_APB3LPENCLRR_SYSCFGLPEN		BIT(11)
#define RCC_MP_APB3LPENCLRR_VREFLPEN		BIT(13)
#define RCC_MP_APB3LPENCLRR_TMPSENSLPEN		BIT(16)
#define RCC_MP_APB3LPENCLRR_PMBCTRLLPEN		BIT(17)

/* RCC_MP_AHB2LPENSETR register fields */
#define RCC_MP_AHB2LPENSETR_DMA1LPEN		BIT(0)
#define RCC_MP_AHB2LPENSETR_DMA2LPEN		BIT(1)
#define RCC_MP_AHB2LPENSETR_DMAMUXLPEN		BIT(2)
#define RCC_MP_AHB2LPENSETR_ADC12LPEN		BIT(5)
#define RCC_MP_AHB2LPENSETR_USBOLPEN		BIT(8)
#define RCC_MP_AHB2LPENSETR_SDMMC3LPEN		BIT(16)

/* RCC_MP_AHB2LPENCLRR register fields */
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN		BIT(0)
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN		BIT(1)
#define RCC_MP_AHB2LPENCLRR_DMAMUXLPEN		BIT(2)
#define RCC_MP_AHB2LPENCLRR_ADC12LPEN		BIT(5)
#define RCC_MP_AHB2LPENCLRR_USBOLPEN		BIT(8)
#define RCC_MP_AHB2LPENCLRR_SDMMC3LPEN		BIT(16)

/* RCC_MP_AHB3LPENSETR register fields */
#define RCC_MP_AHB3LPENSETR_DCMILPEN		BIT(0)
#define RCC_MP_AHB3LPENSETR_CRYP2LPEN		BIT(4)
#define RCC_MP_AHB3LPENSETR_HASH2LPEN		BIT(5)
#define RCC_MP_AHB3LPENSETR_RNG2LPEN		BIT(6)
#define RCC_MP_AHB3LPENSETR_CRC2LPEN		BIT(7)
#define RCC_MP_AHB3LPENSETR_HSEMLPEN		BIT(11)
#define RCC_MP_AHB3LPENSETR_IPCCLPEN		BIT(12)

/* RCC_MP_AHB3LPENCLRR register fields */
#define RCC_MP_AHB3LPENCLRR_DCMILPEN		BIT(0)
#define RCC_MP_AHB3LPENCLRR_CRYP2LPEN		BIT(4)
#define RCC_MP_AHB3LPENCLRR_HASH2LPEN		BIT(5)
#define RCC_MP_AHB3LPENCLRR_RNG2LPEN		BIT(6)
#define RCC_MP_AHB3LPENCLRR_CRC2LPEN		BIT(7)
#define RCC_MP_AHB3LPENCLRR_HSEMLPEN		BIT(11)
#define RCC_MP_AHB3LPENCLRR_IPCCLPEN		BIT(12)

/* RCC_MP_AHB4LPENSETR register fields */
#define RCC_MP_AHB4LPENSETR_GPIOALPEN		BIT(0)
#define RCC_MP_AHB4LPENSETR_GPIOBLPEN		BIT(1)
#define RCC_MP_AHB4LPENSETR_GPIOCLPEN		BIT(2)
#define RCC_MP_AHB4LPENSETR_GPIODLPEN		BIT(3)
#define RCC_MP_AHB4LPENSETR_GPIOELPEN		BIT(4)
#define RCC_MP_AHB4LPENSETR_GPIOFLPEN		BIT(5)
#define RCC_MP_AHB4LPENSETR_GPIOGLPEN		BIT(6)
#define RCC_MP_AHB4LPENSETR_GPIOHLPEN		BIT(7)
#define RCC_MP_AHB4LPENSETR_GPIOILPEN		BIT(8)
#define RCC_MP_AHB4LPENSETR_GPIOJLPEN		BIT(9)
#define RCC_MP_AHB4LPENSETR_GPIOKLPEN		BIT(10)

/* RCC_MP_AHB4LPENCLRR register fields */
#define RCC_MP_AHB4LPENCLRR_GPIOALPEN		BIT(0)
#define RCC_MP_AHB4LPENCLRR_GPIOBLPEN		BIT(1)
#define RCC_MP_AHB4LPENCLRR_GPIOCLPEN		BIT(2)
#define RCC_MP_AHB4LPENCLRR_GPIODLPEN		BIT(3)
#define RCC_MP_AHB4LPENCLRR_GPIOELPEN		BIT(4)
#define RCC_MP_AHB4LPENCLRR_GPIOFLPEN		BIT(5)
#define RCC_MP_AHB4LPENCLRR_GPIOGLPEN		BIT(6)
#define RCC_MP_AHB4LPENCLRR_GPIOHLPEN		BIT(7)
#define RCC_MP_AHB4LPENCLRR_GPIOILPEN		BIT(8)
#define RCC_MP_AHB4LPENCLRR_GPIOJLPEN		BIT(9)
#define RCC_MP_AHB4LPENCLRR_GPIOKLPEN		BIT(10)

/* RCC_MP_AXIMLPENSETR register fields */
#define RCC_MP_AXIMLPENSETR_SYSRAMLPEN		BIT(0)

/* RCC_MP_AXIMLPENCLRR register fields */
#define RCC_MP_AXIMLPENCLRR_SYSRAMLPEN		BIT(0)

/* RCC_MP_MLAHBLPENSETR register fields */
#define RCC_MP_MLAHBLPENSETR_SRAM1LPEN		BIT(0)
#define RCC_MP_MLAHBLPENSETR_SRAM2LPEN		BIT(1)
#define RCC_MP_MLAHBLPENSETR_SRAM34LPEN		BIT(2)
#define RCC_MP_MLAHBLPENSETR_RETRAMLPEN		BIT(4)

/* RCC_MP_MLAHBLPENCLRR register fields */
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN		BIT(0)
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN		BIT(1)
#define RCC_MP_MLAHBLPENCLRR_SRAM34LPEN		BIT(2)
#define RCC_MP_MLAHBLPENCLRR_RETRAMLPEN		BIT(4)

/* RCC_MC_APB1LPENSETR register fields */
#define RCC_MC_APB1LPENSETR_TIM2LPEN		BIT(0)
#define RCC_MC_APB1LPENSETR_TIM3LPEN		BIT(1)
#define RCC_MC_APB1LPENSETR_TIM4LPEN		BIT(2)
#define RCC_MC_APB1LPENSETR_TIM5LPEN		BIT(3)
#define RCC_MC_APB1LPENSETR_TIM6LPEN		BIT(4)
#define RCC_MC_APB1LPENSETR_TIM7LPEN		BIT(5)
#define RCC_MC_APB1LPENSETR_TIM12LPEN		BIT(6)
#define RCC_MC_APB1LPENSETR_TIM13LPEN		BIT(7)
#define RCC_MC_APB1LPENSETR_TIM14LPEN		BIT(8)
#define RCC_MC_APB1LPENSETR_LPTIM1LPEN		BIT(9)
#define RCC_MC_APB1LPENSETR_SPI2LPEN		BIT(11)
#define RCC_MC_APB1LPENSETR_SPI3LPEN		BIT(12)
#define RCC_MC_APB1LPENSETR_USART2LPEN		BIT(14)
#define RCC_MC_APB1LPENSETR_USART3LPEN		BIT(15)
#define RCC_MC_APB1LPENSETR_UART4LPEN		BIT(16)
#define RCC_MC_APB1LPENSETR_UART5LPEN		BIT(17)
#define RCC_MC_APB1LPENSETR_UART7LPEN		BIT(18)
#define RCC_MC_APB1LPENSETR_UART8LPEN		BIT(19)
#define RCC_MC_APB1LPENSETR_I2C1LPEN		BIT(21)
#define RCC_MC_APB1LPENSETR_I2C2LPEN		BIT(22)
#define RCC_MC_APB1LPENSETR_I2C3LPEN		BIT(23)
#define RCC_MC_APB1LPENSETR_I2C5LPEN		BIT(24)
#define RCC_MC_APB1LPENSETR_SPDIFLPEN		BIT(26)
#define RCC_MC_APB1LPENSETR_CECLPEN		BIT(27)
#define RCC_MC_APB1LPENSETR_WWDG1LPEN		BIT(28)
#define RCC_MC_APB1LPENSETR_DAC12LPEN		BIT(29)
#define RCC_MC_APB1LPENSETR_MDIOSLPEN		BIT(31)

/* RCC_MC_APB1LPENCLRR register fields */
#define RCC_MC_APB1LPENCLRR_TIM2LPEN		BIT(0)
#define RCC_MC_APB1LPENCLRR_TIM3LPEN		BIT(1)
#define RCC_MC_APB1LPENCLRR_TIM4LPEN		BIT(2)
#define RCC_MC_APB1LPENCLRR_TIM5LPEN		BIT(3)
#define RCC_MC_APB1LPENCLRR_TIM6LPEN		BIT(4)
#define RCC_MC_APB1LPENCLRR_TIM7LPEN		BIT(5)
#define RCC_MC_APB1LPENCLRR_TIM12LPEN		BIT(6)
#define RCC_MC_APB1LPENCLRR_TIM13LPEN		BIT(7)
#define RCC_MC_APB1LPENCLRR_TIM14LPEN		BIT(8)
#define RCC_MC_APB1LPENCLRR_LPTIM1LPEN		BIT(9)
#define RCC_MC_APB1LPENCLRR_SPI2LPEN		BIT(11)
#define RCC_MC_APB1LPENCLRR_SPI3LPEN		BIT(12)
#define RCC_MC_APB1LPENCLRR_USART2LPEN		BIT(14)
#define RCC_MC_APB1LPENCLRR_USART3LPEN		BIT(15)
#define RCC_MC_APB1LPENCLRR_UART4LPEN		BIT(16)
#define RCC_MC_APB1LPENCLRR_UART5LPEN		BIT(17)
#define RCC_MC_APB1LPENCLRR_UART7LPEN		BIT(18)
#define RCC_MC_APB1LPENCLRR_UART8LPEN		BIT(19)
#define RCC_MC_APB1LPENCLRR_I2C1LPEN		BIT(21)
#define RCC_MC_APB1LPENCLRR_I2C2LPEN		BIT(22)
#define RCC_MC_APB1LPENCLRR_I2C3LPEN		BIT(23)
#define RCC_MC_APB1LPENCLRR_I2C5LPEN		BIT(24)
#define RCC_MC_APB1LPENCLRR_SPDIFLPEN		BIT(26)
#define RCC_MC_APB1LPENCLRR_CECLPEN		BIT(27)
#define RCC_MC_APB1LPENCLRR_WWDG1LPEN		BIT(28)
#define RCC_MC_APB1LPENCLRR_DAC12LPEN		BIT(29)
#define RCC_MC_APB1LPENCLRR_MDIOSLPEN		BIT(31)

/* RCC_MC_APB2LPENSETR register fields */
#define RCC_MC_APB2LPENSETR_TIM1LPEN		BIT(0)
#define RCC_MC_APB2LPENSETR_TIM8LPEN		BIT(1)
#define RCC_MC_APB2LPENSETR_TIM15LPEN		BIT(2)
#define RCC_MC_APB2LPENSETR_TIM16LPEN		BIT(3)
#define RCC_MC_APB2LPENSETR_TIM17LPEN		BIT(4)
#define RCC_MC_APB2LPENSETR_SPI1LPEN		BIT(8)
#define RCC_MC_APB2LPENSETR_SPI4LPEN		BIT(9)
#define RCC_MC_APB2LPENSETR_SPI5LPEN		BIT(10)
#define RCC_MC_APB2LPENSETR_USART6LPEN		BIT(13)
#define RCC_MC_APB2LPENSETR_SAI1LPEN		BIT(16)
#define RCC_MC_APB2LPENSETR_SAI2LPEN		BIT(17)
#define RCC_MC_APB2LPENSETR_SAI3LPEN		BIT(18)
#define RCC_MC_APB2LPENSETR_DFSDMLPEN		BIT(20)
#define RCC_MC_APB2LPENSETR_ADFSDMLPEN		BIT(21)
#define RCC_MC_APB2LPENSETR_FDCANLPEN		BIT(24)

/* RCC_MC_APB2LPENCLRR register fields */
#define RCC_MC_APB2LPENCLRR_TIM1LPEN		BIT(0)
#define RCC_MC_APB2LPENCLRR_TIM8LPEN		BIT(1)
#define RCC_MC_APB2LPENCLRR_TIM15LPEN		BIT(2)
#define RCC_MC_APB2LPENCLRR_TIM16LPEN		BIT(3)
#define RCC_MC_APB2LPENCLRR_TIM17LPEN		BIT(4)
#define RCC_MC_APB2LPENCLRR_SPI1LPEN		BIT(8)
#define RCC_MC_APB2LPENCLRR_SPI4LPEN		BIT(9)
#define RCC_MC_APB2LPENCLRR_SPI5LPEN		BIT(10)
#define RCC_MC_APB2LPENCLRR_USART6LPEN		BIT(13)
#define RCC_MC_APB2LPENCLRR_SAI1LPEN		BIT(16)
#define RCC_MC_APB2LPENCLRR_SAI2LPEN		BIT(17)
#define RCC_MC_APB2LPENCLRR_SAI3LPEN		BIT(18)
#define RCC_MC_APB2LPENCLRR_DFSDMLPEN		BIT(20)
#define RCC_MC_APB2LPENCLRR_ADFSDMLPEN		BIT(21)
#define RCC_MC_APB2LPENCLRR_FDCANLPEN		BIT(24)

/* RCC_MC_APB3LPENSETR register fields */
#define RCC_MC_APB3LPENSETR_LPTIM2LPEN		BIT(0)
#define RCC_MC_APB3LPENSETR_LPTIM3LPEN		BIT(1)
#define RCC_MC_APB3LPENSETR_LPTIM4LPEN		BIT(2)
#define RCC_MC_APB3LPENSETR_LPTIM5LPEN		BIT(3)
#define RCC_MC_APB3LPENSETR_SAI4LPEN		BIT(8)
#define RCC_MC_APB3LPENSETR_SYSCFGLPEN		BIT(11)
#define RCC_MC_APB3LPENSETR_VREFLPEN		BIT(13)
#define RCC_MC_APB3LPENSETR_TMPSENSLPEN		BIT(16)
#define RCC_MC_APB3LPENSETR_PMBCTRLLPEN		BIT(17)

