ARM-software/arm-trusted-firmware/include/drivers/st/stm32mp15_rcc.h
/* RCC_MC_APB3LPENCLRR register fields */
#define RCC_MC_APB3LPENCLRR_LPTIM2LPEN		BIT(0)
#define RCC_MC_APB3LPENCLRR_LPTIM3LPEN		BIT(1)
#define RCC_MC_APB3LPENCLRR_LPTIM4LPEN		BIT(2)
#define RCC_MC_APB3LPENCLRR_LPTIM5LPEN		BIT(3)
#define RCC_MC_APB3LPENCLRR_SAI4LPEN		BIT(8)
#define RCC_MC_APB3LPENCLRR_SYSCFGLPEN		BIT(11)
#define RCC_MC_APB3LPENCLRR_VREFLPEN		BIT(13)
#define RCC_MC_APB3LPENCLRR_TMPSENSLPEN		BIT(16)
#define RCC_MC_APB3LPENCLRR_PMBCTRLLPEN		BIT(17)

/* RCC_MC_AHB2LPENSETR register fields */
#define RCC_MC_AHB2LPENSETR_DMA1LPEN		BIT(0)
#define RCC_MC_AHB2LPENSETR_DMA2LPEN		BIT(1)
#define RCC_MC_AHB2LPENSETR_DMAMUXLPEN		BIT(2)
#define RCC_MC_AHB2LPENSETR_ADC12LPEN		BIT(5)
#define RCC_MC_AHB2LPENSETR_USBOLPEN		BIT(8)
#define RCC_MC_AHB2LPENSETR_SDMMC3LPEN		BIT(16)

/* RCC_MC_AHB2LPENCLRR register fields */
#define RCC_MC_AHB2LPENCLRR_DMA1LPEN		BIT(0)
#define RCC_MC_AHB2LPENCLRR_DMA2LPEN		BIT(1)
#define RCC_MC_AHB2LPENCLRR_DMAMUXLPEN		BIT(2)
#define RCC_MC_AHB2LPENCLRR_ADC12LPEN		BIT(5)
#define RCC_MC_AHB2LPENCLRR_USBOLPEN		BIT(8)
#define RCC_MC_AHB2LPENCLRR_SDMMC3LPEN		BIT(16)

/* RCC_MC_AHB3LPENSETR register fields */
#define RCC_MC_AHB3LPENSETR_DCMILPEN		BIT(0)
#define RCC_MC_AHB3LPENSETR_CRYP2LPEN		BIT(4)
#define RCC_MC_AHB3LPENSETR_HASH2LPEN		BIT(5)
#define RCC_MC_AHB3LPENSETR_RNG2LPEN		BIT(6)
#define RCC_MC_AHB3LPENSETR_CRC2LPEN		BIT(7)
#define RCC_MC_AHB3LPENSETR_HSEMLPEN		BIT(11)
#define RCC_MC_AHB3LPENSETR_IPCCLPEN		BIT(12)

/* RCC_MC_AHB3LPENCLRR register fields */
#define RCC_MC_AHB3LPENCLRR_DCMILPEN		BIT(0)
#define RCC_MC_AHB3LPENCLRR_CRYP2LPEN		BIT(4)
#define RCC_MC_AHB3LPENCLRR_HASH2LPEN		BIT(5)
#define RCC_MC_AHB3LPENCLRR_RNG2LPEN		BIT(6)
#define RCC_MC_AHB3LPENCLRR_CRC2LPEN		BIT(7)
#define RCC_MC_AHB3LPENCLRR_HSEMLPEN		BIT(11)
#define RCC_MC_AHB3LPENCLRR_IPCCLPEN		BIT(12)

/* RCC_MC_AHB4LPENSETR register fields */
#define RCC_MC_AHB4LPENSETR_GPIOALPEN		BIT(0)
#define RCC_MC_AHB4LPENSETR_GPIOBLPEN		BIT(1)
#define RCC_MC_AHB4LPENSETR_GPIOCLPEN		BIT(2)
#define RCC_MC_AHB4LPENSETR_GPIODLPEN		BIT(3)
#define RCC_MC_AHB4LPENSETR_GPIOELPEN		BIT(4)
#define RCC_MC_AHB4LPENSETR_GPIOFLPEN		BIT(5)
#define RCC_MC_AHB4LPENSETR_GPIOGLPEN		BIT(6)
#define RCC_MC_AHB4LPENSETR_GPIOHLPEN		BIT(7)
#define RCC_MC_AHB4LPENSETR_GPIOILPEN		BIT(8)
#define RCC_MC_AHB4LPENSETR_GPIOJLPEN		BIT(9)
#define RCC_MC_AHB4LPENSETR_GPIOKLPEN		BIT(10)

/* RCC_MC_AHB4LPENCLRR register fields */
#define RCC_MC_AHB4LPENCLRR_GPIOALPEN		BIT(0)
#define RCC_MC_AHB4LPENCLRR_GPIOBLPEN		BIT(1)
#define RCC_MC_AHB4LPENCLRR_GPIOCLPEN		BIT(2)
#define RCC_MC_AHB4LPENCLRR_GPIODLPEN		BIT(3)
#define RCC_MC_AHB4LPENCLRR_GPIOELPEN		BIT(4)
#define RCC_MC_AHB4LPENCLRR_GPIOFLPEN		BIT(5)
#define RCC_MC_AHB4LPENCLRR_GPIOGLPEN		BIT(6)
#define RCC_MC_AHB4LPENCLRR_GPIOHLPEN		BIT(7)
#define RCC_MC_AHB4LPENCLRR_GPIOILPEN		BIT(8)
#define RCC_MC_AHB4LPENCLRR_GPIOJLPEN		BIT(9)
#define RCC_MC_AHB4LPENCLRR_GPIOKLPEN		BIT(10)

/* RCC_MC_AXIMLPENSETR register fields */
#define RCC_MC_AXIMLPENSETR_SYSRAMLPEN		BIT(0)

/* RCC_MC_AXIMLPENCLRR register fields */
#define RCC_MC_AXIMLPENCLRR_SYSRAMLPEN		BIT(0)

/* RCC_MC_MLAHBLPENSETR register fields */
#define RCC_MC_MLAHBLPENSETR_SRAM1LPEN		BIT(0)
#define RCC_MC_MLAHBLPENSETR_SRAM2LPEN		BIT(1)
#define RCC_MC_MLAHBLPENSETR_SRAM34LPEN		BIT(2)
#define RCC_MC_MLAHBLPENSETR_RETRAMLPEN		BIT(4)

/* RCC_MC_MLAHBLPENCLRR register fields */
#define RCC_MC_MLAHBLPENCLRR_SRAM1LPEN		BIT(0)
#define RCC_MC_MLAHBLPENCLRR_SRAM2LPEN		BIT(1)
#define RCC_MC_MLAHBLPENCLRR_SRAM34LPEN		BIT(2)
#define RCC_MC_MLAHBLPENCLRR_RETRAMLPEN		BIT(4)

/* RCC_MC_RSTSCLRR register fields */
#define RCC_MC_RSTSCLRR_PORRSTF			BIT(0)
#define RCC_MC_RSTSCLRR_BORRSTF			BIT(1)
#define RCC_MC_RSTSCLRR_PADRSTF			BIT(2)
#define RCC_MC_RSTSCLRR_HCSSRSTF		BIT(3)
#define RCC_MC_RSTSCLRR_VCORERSTF		BIT(4)
#define RCC_MC_RSTSCLRR_MCURSTF			BIT(5)
#define RCC_MC_RSTSCLRR_MPSYSRSTF		BIT(6)
#define RCC_MC_RSTSCLRR_MCSYSRSTF		BIT(7)
#define RCC_MC_RSTSCLRR_IWDG1RSTF		BIT(8)
#define RCC_MC_RSTSCLRR_IWDG2RSTF		BIT(9)
#define RCC_MC_RSTSCLRR_WWDG1RSTF		BIT(10)

/* RCC_MC_CIER register fields */
#define RCC_MC_CIER_LSIRDYIE			BIT(0)
#define RCC_MC_CIER_LSERDYIE			BIT(1)
#define RCC_MC_CIER_HSIRDYIE			BIT(2)
#define RCC_MC_CIER_HSERDYIE			BIT(3)
#define RCC_MC_CIER_CSIRDYIE			BIT(4)
#define RCC_MC_CIER_PLL1DYIE			BIT(8)
#define RCC_MC_CIER_PLL2DYIE			BIT(9)
#define RCC_MC_CIER_PLL3DYIE			BIT(10)
#define RCC_MC_CIER_PLL4DYIE			BIT(11)
#define RCC_MC_CIER_LSECSSIE			BIT(16)
#define RCC_MC_CIER_WKUPIE			BIT(20)

/* RCC_MC_CIFR register fields */
#define RCC_MC_CIFR_LSIRDYF			BIT(0)
#define RCC_MC_CIFR_LSERDYF			BIT(1)
#define RCC_MC_CIFR_HSIRDYF			BIT(2)
#define RCC_MC_CIFR_HSERDYF			BIT(3)
#define RCC_MC_CIFR_CSIRDYF			BIT(4)
#define RCC_MC_CIFR_PLL1DYF			BIT(8)
#define RCC_MC_CIFR_PLL2DYF			BIT(9)
#define RCC_MC_CIFR_PLL3DYF			BIT(10)
#define RCC_MC_CIFR_PLL4DYF			BIT(11)
#define RCC_MC_CIFR_LSECSSF			BIT(16)
#define RCC_MC_CIFR_WKUPF			BIT(20)

/* RCC_VERR register fields */
#define RCC_VERR_MINREV_MASK			GENMASK(3, 0)
#define RCC_VERR_MINREV_SHIFT			0
#define RCC_VERR_MAJREV_MASK			GENMASK(7, 4)
#define RCC_VERR_MAJREV_SHIFT			4

/* Used for RCC_OCENSETR and RCC_OCENCLRR registers */
#define RCC_OCENR_HSION				BIT(0)
#define RCC_OCENR_HSIKERON			BIT(1)
#define RCC_OCENR_CSION				BIT(4)
#define RCC_OCENR_CSIKERON			BIT(5)
#define RCC_OCENR_DIGBYP			BIT(7)
#define RCC_OCENR_HSEON				BIT(8)
#define RCC_OCENR_HSEKERON			BIT(9)
#define RCC_OCENR_HSEBYP			BIT(10)
#define RCC_OCENR_HSECSSON			BIT(11)

/* Offset between RCC_MP_xxxENSETR and RCC_MP_xxxENCLRR registers */
#define RCC_MP_ENCLRR_OFFSET			U(4)

/* Offset between RCC_xxxRSTSETR and RCC_xxxRSTCLRR registers */
#define RCC_RSTCLRR_OFFSET			U(4)

/* Used for most of DIVR register: max div for RTC */
#define RCC_DIVR_DIV_MASK			GENMASK(5, 0)
#define RCC_DIVR_DIVRDY				BIT(31)

/* Masks for specific DIVR registers */
#define RCC_APBXDIV_MASK			GENMASK(2, 0)
#define RCC_MPUDIV_MASK				GENMASK(2, 0)
#define RCC_AXIDIV_MASK				GENMASK(2, 0)
#define RCC_MCUDIV_MASK				GENMASK(3, 0)

